{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report confirming that the Login page reads and displays the school logo from localStorage settings, with high confidence and a reference to REQ-1.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing their purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for the design system's color tokens in both light and dark modes, including sidebar, chart, and semantic UI colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'Aplikasi Inventaris SMKN 1 Dawuan' that mounts the app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Main application entry point that configures TanStack Router with all admin and user routes, wraps the app in AuthProvider, seeds localStorage on mount, and renders the Toaster.",
  "frontend/src/components/Layout.tsx": "App shell component with a responsive sidebar and top header that reads the school logo from localStorage on mount and route changes, displaying it or a fallback icon alongside role-based navigation items.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login and redirects users with disallowed roles to their respective dashboards.",
  "frontend/src/components/StatusBadge.tsx": "Reusable badge component that renders a styled pill label for borrowing statuses (Pending, Approved, Rejected, Returned) and item availability states.",
  "frontend/src/contexts/AuthContext.tsx": "React context providing authentication state and login/logout/updateCurrentUser actions backed by localStorage via storage utilities.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using TanStack Query, recreating it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Intentionally empty placeholder file noting that all data operations are handled via localStorage through `utils/storage.ts` rather than backend canister calls.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, and defines CSS custom properties for a navy blue theme including light/dark mode variables, sidebar colors, and status badge utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider`, `InternetIdentityProvider`, and the root `App` component into the DOM.",
  "frontend/src/pages/admin/BorrowingList.tsx": "Admin page for managing borrowing requests, allowing filtering by status and performing approve, reject (with reason), and return actions with paginated display. Updates item availability quantities in localStorage on each action.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard page that displays summary statistics cards for items, borrowings, and users, along with borrowing status counts and a list of the five most recent borrowing requests.",
  "frontend/src/pages/admin/ItemDetail.tsx": "Displays detailed information about a single inventory item, with options to edit or delete it. Uses a confirmation dialog before deletion and navigates back to the item list afterward.",
  "frontend/src/pages/admin/ItemForm.tsx": "Reusable form component for adding or editing inventory items, with validation and local storage persistence. Supports both 'add' and 'edit' modes determined by a prop.",
  "frontend/src/pages/admin/ItemList.tsx": "Paginated, searchable, and filterable table listing all inventory items with actions to view, edit, or delete each entry. Manages local state synced with localStorage.",
  "frontend/src/pages/admin/Reports.tsx": "Displays a date-filtered borrowing report with summary statistics and a detailed table, with the ability to export the filtered data as a CSV file.",
  "frontend/src/pages/admin/Settings.tsx": "Admin settings page for managing school profile information including name, address, and logo upload, persisting changes to localStorage.",
  "frontend/src/pages/admin/UserForm.tsx": "A form component for adding or editing users, with validation for fields like username uniqueness, password confirmation, and required inputs, saving data via storage utilities.",
  "frontend/src/pages/admin/UserList.tsx": "Displays a paginated, searchable table of all users with options to add, edit, or delete users, preventing deletion of the currently logged-in account.",
  "frontend/src/pages/Login.tsx": "Login page component with a username/password form that authenticates against the local auth context and redirects users to their role-specific dashboard. Displays a school logo and branding for SMKN 1 Dawuan.",
  "frontend/src/pages/user/BorrowForm.tsx": "A form for users to submit borrowing requests, validating item selection, quantity against available stock, and date range before saving a new borrowing record.",
  "frontend/src/pages/user/BorrowingHistory.tsx": "Shows the current user's borrowing history in a paginated table with status filtering options and item name resolution.",
  "frontend/src/pages/user/Catalog.tsx": "Displays a searchable, category-filterable grid of available inventory items, each showing details like condition and stock, with a link to the borrow form.",
  "frontend/src/pages/user/Dashboard.tsx": "User dashboard page showing borrowing stats (active, pending, total), a list of currently borrowed items, and recent borrowing history fetched from localStorage.",
  "frontend/src/pages/user/Profile.tsx": "User profile page with a form to update full name, class/position, ID number, and password, with validation and localStorage persistence.",
  "frontend/src/types/index.ts": "TypeScript type definitions for core domain models: Item, User, Borrowing, Settings, and AuthUser.",
  "frontend/src/utils/csv.ts": "Utility that exports a list of Borrowing records to a UTF-8 CSV file by resolving user and item names from storage.",
  "frontend/src/utils/seedData.ts": "Seed data module that populates localStorage with sample items, users, borrowings, and settings for initial app setup.",
  "frontend/src/utils/storage.ts": "localStorage abstraction layer providing CRUD helpers for Items, Users, Borrowings, Settings, and Auth user, plus a generateId utility.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (navy, chart, sidebar), OKLCH CSS variable-based theming, custom fonts, shadows, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state metadata tracking version, existing features, and a pending feature request to display the school logo on the login page."
}